# SU-YOLO 720p Nano — 60+ FPS at 1280x720 on ZCU102 (3x B4096 DPU @ 281MHz)
#
# Optimized for VisDrone aerial detection:
#   - P2 (stride 4) + P3 (stride 8) only — no P4/P5 (drone objects are small)
#   - width_multiple: 0.5 — halved channels (32/64/128 instead of 64/128/256)
#   - reg_max: 8 — lighter bbox distribution (saves ~15% on detect heads)
#   - 2-stage backbone (no 3rd downsampling) — preserves spatial detail
#   - time_step: 1 recommended for DPU deployment
#
# Estimated compute at 1280x736, time_step=1:
#   ~5.5 GOPS → 3450 TOPS / 5.5 ≈ ~62 FPS on ZCU102 (theoretical)
#
# Train: python train.py --cfg models/detect/su-yolo-720p-nano.yaml
#          --data data/visdrone.yaml --img 736 --batch 16 --time-step 1 --epochs 300
# Export: python export.py --weights best.pt --imgsz 736 1280 --include vitisai

# parameters
nc: 10  # VisDrone classes (overridden by data yaml at runtime)
depth_multiple: 1.0
width_multiple: 0.5  # halved channels: 64→32, 128→64, 256→128
reg_max: 8  # lighter bbox regression (default 16)

# anchors
anchors: 2

# backbone — 2-stage only (P1→P2→P3), no P4
backbone:
  [
   # conv down
   [-1, 1, SEncoder, [64, 3, 2]],  # 0-P1/2  (ch=32 after width_multiple)

   # elan-1 block
   [-1, 1, BasicBlock1, [128, 128, 64, 1]],  # 1-P2/4  (ch=64)

   # elan-2 block
   [-1, 1, BasicBlock1, [256, 256, 128, 1]],  # 2-P3/8  (ch=128)
  ]

# head — P2/P3 two-scale detection (small + medium objects)
head:
  [
    # P3 refinement via 1x1 reduce
   [ -1, 1, SConv, [ 128, 1, 1 ] ],  # 3 — channel reduce on P3

    # up-concat merge to P2
   [ -1, 1, SUpsample, [ 2 ] ],  # 4
   [ [ -1, 1 ], 1, SConcat, [ 1 ] ],  # 5 — cat backbone P2

    # elan-2 block for P2
   [ -1, 1, BasicBlock2, [ 128, 128, 64, 1 ] ],  # 6 (P2/4-small)

    # down-conv merge back to P3
   [-1, 1, SConv, [128, 3, 2]],  # 7
   [ [ -1, 3 ], 1, SConcat, [ 1 ] ],  # 8 — cat head P3

    # elan-2 block for P3
   [ -1, 1, BasicBlock2, [ 128, 128, 64, 1 ] ],  # 9 (P3/8-medium)

    # detect at P2 + P3 (2 scales — small and medium objects)
   [ [ 6, 9 ], 1, SDDetect, [ nc ] ],  # SDDetect(P2, P3)
  ]
